# --------------------------------------------------------------------------------------------------

# 0726 오전1)
# 1. openJDK 다운 및 설치
# 2. 어제자 과제 리뷰
# call by reference -> 개념 알아야 함
# 변하지 않는 상수값. 즉, 숫자값은 대문자로
# -> 공통적으로 들어가면서 바뀔 수도 있는 경우 ex) 10대, 20대 랭킹 등 이럴 경우 인지할 것
# 
# 55번줄, 딕셔너리활용 -> 있으며 넣고, 없으면 지나가고
# 필요한 정보다 dd에 많기 때문에 find_all로 다 불러옴
# --------------------------------------------------------------------------------------------------
# 오전2)
# 1. 워드 클라우드 사용을 위한 각종 프로그램, 라이브러리 설치
# - 워드클라우드는 딕셔너리만 적절히 쓸 수 있으면 얼마든지 활용할 수 있을 것임

# Twitter로 나오는 것은 Okt로 바꾸면 됨
# open에는 endcoding 넣어서 'utf-8'

# Counter(리스트) 활용!
# most_common(n) : 가장 많은 수를 가지는 항목 n개 반환
# print(tags) 한 것 -> #13 하단
# 폰트는 얼마든지 바꿔줘도 되죠 (경로쓸 때, window는 역슬러시!)
# font_path = 폰트 경로
# cloud = ~에다가 '데이터,숫자'로 구성되는 디셔너리만 있으면 집어 넣으면 형태소 분석을 하지 않아도 가능
# plt. imshow(변수)
# 생성된 WordCloud를 test.jpg로 보낸다.
# cloud.to_file('test.jpg')
# 검색어와 빈도수(수치)로 나오기 때문에 워드클라우드 말고 다른 그래프로도 사용 가능






# --------------------------------------------------------------------------------------------------
# --------------------------------------------------------------------------------------------------
# --------------------------------------------------------------------------------------------------
# --------------------------------------------------------------------------------------------------
# --------------------------------------------------------------------------------------------------